Revit 2026 API

# FabricationService Methods

---

The FabricationService type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetButton | Gets the service button for a given palette index and button index from the service. |
|  | GetButtonCount | Gets the number of buttons for a given palette in the service. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetPaletteName | Gets the name of a palette based on palette index. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCompatibleWith | Check whether the service is broadly interchangable with another one without affecting part geometry. The services must have the same fabrication system template and specification. |
|  | IsPaletteExcluded | Get whether a service palette is excluded from being used by the Route and Fill, Design to Fabrication, or Multi Point Routing commands. The default configuration values may be overridden by SetServicePaletteExclusions. |
|  | IsValidButtonIndex | Validates the button index. |
|  | IsValidPaletteIndex | Validates the palette index. |
|  | OverrideServiceButtonExclusion | Overrides the default service button exclusions, used by Route and Fill, Design to Fabrication, or Multi Point Routing for the current user and session only. |
|  | ResetServiceExclusionOverrides | Resets the overridden service palette and button exclusions back to default, as defined by the configuration. |
|  | SetServicePaletteExclusions |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

FabricationService Class

Autodesk.Revit.DB Namespace